text_help = (
    "Вот что я умею:\n"
    "— Искать и показывать подборку мемов по запросу."
    "Используй команду /memes "
    "(или просто отправь слово/фразу, чтобы я подобрал мемы по тегам). "
    "Я выведу первые 5 изображений и предложу кнопку «Следующий наборчик мемов», "
    "чтобы продолжить просмотр (структуру запроса потом доработаем, пока не пишу ничего).\n"
    "— Сохранять понравившиеся мемы в избранное. Под каждым запросом будет кнопка "
    "«Добавить мем в избранное». Нажми на неё, выбери номер мема — и он попадёт в твою личную коллекцию.\n"
    "— Показывать сохранённые мемы. Команда /favourites отправит все мемы, которые ты сохранил.\n\n"

    "Memes:\n"
    "Отправь мне любое слово или фразу — я подберу мемы по этому запросу. "
    "Это может быть что угодно: эмоция, тема, персонаж или описание ситуации.\n"
    "Примеры: «грустный кот», «вот это я», «устал», «смешная собака».\n"
    "Напиши свой запрос, и я пришлю подборку из 5 мемов. Если вариантов много, "
    "предложу кнопку «Следующий наборчик мемов», чтобы ты мог продолжить просмотр.\n\n"

    "Favorites:\n"
    "Здесь собраны все мемы, которые ты добавил в избранное.\n"
    "Чтобы сохранить мемы, просто нажимай кнопку под понравившимися изображениями во время поиска.\n"
    "Если ты ещё не зарегистрировался, я подскажу, как это сделать. Регистрация нужна, "
    "чтобы я мог хранить твою персональную коллекцию.\n"
)

text_start = (
    "Привет! Я — бот, который помогает находить мемы по вашим тэгам и "
    "сохранять любимые в избранное.\n\n"
    "Вот что я умею:\n"
    "• Находить и показывать подборку мемов по твоему запросу. Просто отправь любое слово или фразу, "
    "а я найду мемы по тегам. Я выдам подборку из 5 изображений и, если вариантов много, предложу кнопку "
    "«Следующий наборчик мемов».\n\n"
    "• Сохранять понравившиеся мемы в избранное. Нажми на кнопку под мемом/альбомом мемов — он попадет "
    "в твой личный список.\n\n"
    "• Показывать твои избранные мемы. В любой момент ты можешь вернуть себе настроение и пересмотреть "
    "свою коллекцию. (кнопка «Избранное» или команда /favourites)\n\n"
    "• Помогать, если что-то непонятно. Команда /help объяснит, как пользоваться ботом\n\n"
    "Важно: Чтобы сохранять мемы в избранное, сначала зарегистрируйся."
    " Регистрация использует только твой Telegram ID - никаких личных данных не требуется."
)

text_no_fav = (
    "У тебя пока нет избранных мемов.\n"
    "Найди первый через /memes и добавь его в избранное"
)
