text_help = (
    "Вот что я умею:\n"
    "\n"
    "📌 Искать и показывать подборку мемов по запросу"
    "\n"
    "\n"
    "Просто нажми на кнопку «Найти мем» в главном меню\n"
    "Напиши слово/фразу, чтобы я нашел подборку мемов по твоей ассоциации. "
    "Я выведу первые 6 изображений и предложу кнопку «Еще мемы» , если тебе будет мало."
    "\n"
    "\n"
    "📌Сохранять понравившиеся мемы в избранное "
    "\n"
    "\n"
    "Под каждым альбомчиком есть кнопка «Добавить в избранное»."
    "Нажми на неё и выбери номер мема — он попадёт в твою личную коллекцию.\n"
    "\n"
    "📌Показывать сохранённые мемы"
    "\n"
    "\n"
    " Нажми на кнопку  «Избранное» в главном меню\n"
    "Я покажу тебе все мемы, которые ты сохранил.\n\n"
    "\n"
)

text_start = (
    "Привет😊! \n"
    "\n"
    "Я — бот, который помогает находить мемы по вашим запросам и "
    "сохранять понравившееся в избранное\n\n"
    "Хочешь использовать смешную картинку в диалоге, но не можешь найти ничего подходящего😱?\n"
    "\n"
    "Я — тот, кто тебе нужен💯\n"
    "\n"
    "P.S:\n"
    "\n"
    "Чтобы разобраться, как мной пользоваться нажми на кнопку «Помощь» в главном меню 👇"
)

text_no_fav = (
    "У тебя пока нет избранных мемов.\n"
    "Найди первый через /memes и добавь его в избранное🔥"
)

MAX_FAV = 10
PAGE = 6
